<template>
  <div class="w-[70%] mx-auto mb-[40px]">
    <h2 class="text-[45px] font-semibold mb-[10px]">Как вызвать проститутку в Москве</h2>
    <p class="text-[#6F717C] text-[22px]">Для оказания интим услуг можно воспользоваться Telegram, WhatsApp, Viber или звонком на мобильный телефон. Номера проституток указаны в анкетах, там же есть ссылки на личные мессенджеры. </p>
    <br>
    <p class="text-[#6F717C] text-[22px]">На сайте гарантируется полная анонимность. Мы не сохраняем личные данные клиентов и не передаём их третьим лицам.</p>
  </div>
</template>
