<template>
  <footer class="relative md:flex rounded-[10px] flex-wrap bg-[#1F2228] md:px-[15%] md:py-[60px] px-[10px] py-[15px]">

  <div class="w-1/3 md:block hidden">
    <h2 class="text-white text-[35px]">avrora</h2>
    <p class="text-[#FFFFFF99]">2024. Avrora - проект, созданный<br>для удобного поиска проституток,<br>
      массажисток и эскорт-моделей<br>
      по всей России.</p>

  </div>
  <ul class="md:w-1/3 leading-7 mx-auto text-white">
    <li>
    Главная
    </li>
    <li>
      О проекте
    </li>
    <li>
      Информация
    </li>
    <li>
      Реклама на Сайте
    </li>
    <li>
      Контакты
    </li>
  </ul>
  <div class="md:w-[33%] mt-[20px] text-white">
    <a href="">Пользовательское соглашение для<br> клиентов</a> <br>
    <a href="" class="mt-[25px]">Пользовательское соглашение для рекламодателей</a>
  </div>
  <div class="w-full mt-[20px] flex">
      <WhiteButton>
        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M16.2108 6.02392L14.1358 15.5709C13.9791 16.2446 13.571 16.4123 12.991 16.0951L9.82915 13.822L8.30372 15.2537C8.13478 15.4186 7.99382 15.5561 7.66821 15.5561L7.8956 12.4148L13.7552 7.2491C14.0101 7.02773 13.6997 6.90459 13.3594 7.12644L6.11528 11.5768L2.99664 10.6242C2.3184 10.4177 2.30612 9.96251 3.13809 9.64483L15.3361 5.05988C15.9009 4.85336 16.395 5.18206 16.2108 6.02392Z" fill="#14151A"/>
        </svg>
        Telegram
      </WhiteButton>
      <WhiteButton class="mx-[10px]">
        <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M15.1917 7.03178C15.1969 7.14679 15.1995 7.26233 15.1995 7.37839C15.1995 10.9183 12.5048 15 7.57819 15C6.06532 15 4.65711 14.5565 3.47168 13.7964C3.68151 13.8213 3.89445 13.834 4.11077 13.834C5.36588 13.834 6.52072 13.4057 7.43778 12.6871C6.26531 12.6656 5.27624 11.8911 4.93534 10.8269C5.09907 10.8582 5.26669 10.8751 5.43947 10.8751C5.68348 10.8751 5.92024 10.8422 6.14512 10.781C4.9198 10.5349 3.99625 9.45234 3.99625 8.15448C3.99625 8.14309 3.99625 8.13195 3.99653 8.12081C4.35765 8.32131 4.77058 8.44178 5.20991 8.45576C4.49105 7.9755 4.01827 7.15558 4.01827 6.2261C4.01827 5.7352 4.15012 5.27513 4.38092 4.87954C5.70211 6.50016 7.67554 7.56642 9.90185 7.67833C9.85627 7.48223 9.83241 7.27784 9.83241 7.06776C9.83241 5.58857 11.0318 4.38916 12.511 4.38916C13.282 4.38916 13.9778 4.71453 14.4663 5.23496C15.0767 5.11502 15.6497 4.89199 16.1672 4.58499C15.9673 5.21061 15.5429 5.73544 14.9896 6.06701C15.5315 6.00224 16.0481 5.85823 16.5284 5.64529C16.1693 6.18233 15.715 6.65406 15.1917 7.03178Z" fill="#14151A"/>
        </svg>
        Twitter
      </WhiteButton>
      <button class="md:ml-auto border-white border-[1px] py-[6px] px-[10px] rounded-[15px] text-white">18+</button>
    </div>
  </footer>
</template>
<script setup lang="ts">
import WhiteButton from "~/components/UI/WhiteButton.vue";
</script>
